/**
 * Created by andrey.prudnyk on 24.12.2015.
 */
public class NaturalN {
    static public void main(String[] arg){
        double n = 4.352732423;
        String nString = String.valueOf(n);
        System.out.println(nString.length()-1);
    }
}

/*
3.Натуральное положительное число записано в переменную n.

Определить и вывести на экран, сколько цифр в числе n.
 */